Y PROJECTS -*- mode: org; -*-

**** if test prog
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
  int i = 5;
  int j = 0;
  int k = -1;

  if ( i ) {
    std::cout << "I tests true" << std::endl;
  }
  if ( j ) {
    std::cout << "J tests true" << std::endl;
  }
  if ( k ) {
    std::cout << "K tests true" << std::endl;
  }

#+end_src

#+results:
: I tests true
: K tests true

***** Example
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" "<array>" ) :results output replace
using namespace std;

//void test( int data[] ) {   // this will not work.
void test( std::vector<int> data ) {
//void test( std::array<int, 5> data ) {

   for ( int n : data ) {
    cout << "---- " << n << endl;
   }

}

int main () {
  //int data[] = {1,2,3,4,5};
  std::vector<int> data = {1,2,3,4,5};
  //std::array<int, 5> data = {1,2,3,4,5};

  for ( int n : data ) {
    cout << n << endl;
  }

  test( data );

}
#+end_src

#+results:
#+begin_example
1
2
3
4
5
---- 1
---- 2
---- 3
---- 4
---- 5
#+end_example

*** Factorial test
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace

int factorial = 1;
for ( int i = 1; i <= 5; i++ ) {
  factorial = factorial * i;
}
std::cout << "Factorial = " << factorial << std::endl;

int i = 1;
factorial = 1;
while ( i <= 5 ) {
  factorial = factorial * i;
  i++;
} 
std::cout << "Factorial = " << factorial << std::endl;

    int x = 1;
    do {
      std::cout << "values are " << x << std::endl;
      x++;
    } while ( x < 10 );

#+end_src

#+results:
#+begin_example
Factorial = 120
Factorial = 120
values are 1
values are 2
values are 3
values are 4
values are 5
values are 6
values are 7
values are 8
values are 9
#+end_example

** STL Vectors
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" ) :results output replace :cmdline -std=c++11
using namespace std;

void print_vector( std::vector<int> &junk) {
   
   junk.push_back( 22 );
   for ( int i = 0; i < junk.size(); i++) {
     cout << "Value at index " << i << " is " << junk[i] << endl;
   }
   cout << endl;
}

 int main() {
 
  std::vector<int> someData = {10, 20, 30, 40};
   someData.push_back( 50 );
   cout << someData[2] << endl;
   cout << someData[ someData.size() - 1 ] << endl;
   someData.pop_back();
   cout << someData[ someData.size() - 1 ] << endl;
   print_vector( someData );
   print_vector( someData );
   print_vector( someData );

}
#+end_src

#+results:
#+begin_example
30
50
40
Value at index 0 is 10
Value at index 1 is 20
Value at index 2 is 30
Value at index 3 is 40
Value at index 4 is 22

Value at index 0 is 10
Value at index 1 is 20
Value at index 2 is 30
Value at index 3 is 40
Value at index 4 is 22
Value at index 5 is 22

Value at index 0 is 10
Value at index 1 is 20
Value at index 2 is 30
Value at index 3 is 40
Value at index 4 is 22
Value at index 5 is 22
Value at index 6 is 22
#+end_example

*** vector allocation time
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" "<chrono>" ) :results output replace :cmdline -std=c++11

using std::vector; 
using std::cout; 
using namespace std::chrono; 
  
int main() 
{ 
    // No of charactes 
    int N = (int)1e6; 
  
    vector<int> v1, v2; 
  
    // Reserve space in v2 
    v2.reserve(N); 
  
    // Start filling up elements in v1 
    // To measure execution time in C++, refer below 
    // https://www.geeksforgeeks.org/measure-execution-time-function-cpp/ 
  
    auto start = high_resolution_clock::now(); 
    for (int i = 0; i < N; ++i) 
        v1.push_back(i); 
    auto stop = high_resolution_clock::now(); 
    auto duration = duration_cast<microseconds>(stop - start); 
  
    cout << "Method I took " << duration.count() << " microseconds\n"; 
  
    // Start filling up elements in v2 
    start = high_resolution_clock::now(); 
    for (int i = 0; i < N; ++i) 
        v2.push_back(i); 
    stop = high_resolution_clock::now(); 
    duration = duration_cast<microseconds>(stop - start); 
  
    cout << "Method II took " << duration.count()  
         << " microseconds \n"; 
  
    return 0; 
} 



#+end_src

#+results:
: Method I took 30726 microseconds
: Method II took 36347 microseconds

** STL Arrays
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>"  "<array>" ) :results output replace :cmdline -std=c++11
using namespace std;


void print_ary( std::array<int, 5> junk) {
   
   for ( int i = 0; i < junk.size(); i++) {
     cout << "Value at index " << i << " is " << junk[i] << endl;
   }
   cout << endl;
}

 int main() {
   std::array<int, 5> data = { 1, 2, 3 };
   print_ary( data );
 } 
#+end_src

#+results:
: Value at index 0 is 1
: Value at index 1 is 2
: Value at index 2 is 3
: Value at index 3 is 0
: Value at index 4 is 0

**** write files
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" "<array>" "<fstream>" ) :results output replace :cmdline -std=c++11  :var input=input

  std::string fileName = input;

  std::ofstream file;
  //file.open( "out.txt", std::ios::app );
  file.open( fileName, std::ios::app );

  if ( file.is_open() ) {
    std::cout << "I can write\n";
  } else {
    std::cout << "I cannot write\n";
  }

  std::vector<std::string> names;

  names.push_back( "john" );
  names.push_back( "nancy" );
  names.push_back( "bob" );

  file << "Some text is here";
  for ( std::string name : names ) {
    file << name << std::endl;
    }
#+end_src

#+results:
: I can write

**** read files
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" "<array>" "<fstream>" ) :results output replace :cmdline -std=c++11  :var input=input

std::string fileName = input;

std::ifstream file( fileName );

std::string line;
 if ( file.is_open() ) {
   while ( file >> line ) {
    std::cout << line << std::endl;
   }
 } else {
   std::cout << "File " << fileName << " not found" << std::endl;

 }
#+end_src

#+results:
: 88.5
: 22.1
: 95.8
: 100.0
: 95.6

*** Hello World
#+begin_src C++ :includes <iostream>
  std::cout << "Hello world\n";
#+end_src

#+results:
: Hello world

*** decimal, hex, octal, operators
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace

   int dec = 20;
   int hex = 0x20;
   int oct = 020;

   std::cout << "dec = " << dec << std::endl;
   std::cout << "hex = " << hex << std::endl;
   std::cout << "oct = " << oct << std::endl;

   std::cout << "convert dec to hex = " << std::hex << dec << std::endl;
   std::cout << "convert dec to oct = " << std::oct << dec << std::endl;
   
   double intDiv = 10 / 4;
   double floatDiv = 10. / 4;
   
   std::cout << "intDiv = " << intDiv << std::endl;
   std::cout << "floatDiv = " << floatDiv << std::endl;


#+end_src

#+results:
: dec = 20
: hex = 32
: oct = 16
: convert dec to hex = 14
: convert dec to oct = 24
: intDiv = 2
: floatDiv = 2.5

**** address of
#+begin_src C++  :results output replace :includes <iostream>
  int number = 250;
  int* numPtr;        // The datatypes must be of the same type
  numPtr = &number;
  double num2 = 1.1;
  double* numPtr2;
  numPtr2 = &num2;
  std::cout << "The address of number is " << numPtr  << std::endl;
  std::cout << "The address of num2   is " << numPtr2 << std::endl;
#+end_src

#+results:
: The address of number is 0x3fffc03b05700x3fffc03b0578
: The address of num2   is 0x3fffc03b0578
**** size of
#+begin_src C++ :includes <iostream> :results output replace
        using namespace std;

	cout << "Size of boolean: " << sizeof(bool) << endl;
	cout << "Size of char: " << sizeof(char) << endl;
	cout << "Size of int: " << sizeof(int) << endl;
	cout << "Size of float: " << sizeof(float) << endl;
	cout << "Size of long: " << sizeof(long) << endl;
	cout << "Size of double: " << sizeof(double) << endl;

	bool* pBool;
	char* pChar;
	int* pInt;
	cout << "Size of boolean ptr: " << sizeof(pBool) << endl;
	cout << "Size of char ptr: " << sizeof(pChar) << endl;
	cout << "Size of int ptr: " << sizeof(pInt) << endl;
#+end_src

#+results:
: Size of boolean: 1
: Size of char: 1
: Size of int: 4
: Size of float: 4
: Size of long: 8
: Size of double: 8
: Size of boolean ptr: 8
: Size of char ptr: 8
: Size of int ptr: 8

**** array pointer
#+begin_src C++ :includes <iostream> :results output replace
        using namespace std;
	double values[10];	 //declare an array values with 10 elements
	double* pValue = values; //define a pointer to the array
	cout << "value array address: "<< values << endl;	
	cout << "pValues: " << pValue << endl;
	
	for( int i=0; i < 10; i++) {
	   cout << "Address of  " << i << " " << pValue + i << endl;
        }


#+end_src

#+results:
#+begin_example
value array address: 0x3fffdf31cbb0
pValues: 0x3fffdf31cbb0
Address of  0 0x3fffdf31cbb0
Address of  1 0x3fffdf31cbb8
Address of  2 0x3fffdf31cbc0
Address of  3 0x3fffdf31cbc8
Address of  4 0x3fffdf31cbd0
Address of  5 0x3fffdf31cbd8
Address of  6 0x3fffdf31cbe0
Address of  7 0x3fffdf31cbe8
Address of  8 0x3fffdf31cbf0
Address of  9 0x3fffdf31cbf8
#+end_example

**** character pointer
#+name: input
#+begin_src elisp
(completing-read "Enter a number: " nil)
#+end_src

#+results: input
: 5

#+begin_src C++ :includes '( "<iostream>" "<stdlib.h>" ) :results output replace :var input=input
        using namespace std;
	char initial = 'P';
	char* pInitial = &initial;
	cout << "Memory address for initial P: " << (void *)pInitial<<endl;
	cout << "Memory address for initial P: " << static_cast <void *>(pInitial) << endl;

	const char* pans1{ "Absolutely yes" };
	const char* pans2{ "Absolutely no" };
	const char* pans3{ "The oracle is out, please try again later" };
	const char* pans4{ "Outlook is good" };
	const char* pans5{ "Today is your lucky day, yes" };
	const char* pans6{ "Try again tomorrow" };
	const char* pans7{ "Most certainly" };
	const char* pans8{ "The answer is unclear" };
	const char* pans{ "The oracle says... " };
//	int choice{};

	cout << "Think of a yes/no question, then ask the oracle" << endl;
	cout << "Enter a number between 1 and 8: ";
	//cin >> choice;
	int choice = atoi(input);
	switch (choice)
	{
	case 1:
		cout << pans << pans1 << endl;
		break;
	case 2:
		cout << pans << pans2 << endl;
		break;
	case 3:
		cout << pans << pans3 << endl;
		break;
	case 4:
		cout << pans << pans4 << endl;
		break;
	case 5:
		cout << pans << pans5 << endl;
		break;
	case 6:
		cout << pans << pans6 << endl;
		break;
	case 7:
		cout << pans << pans7 << endl;
		break;
	case 8:
		cout << pans << pans8 << endl;
		break;
	default:
		cout << "Sorry, you didn't choose a number between 1 and 8." << endl;
	}


#+end_src

#+results:
: Memory address for initial P: 0x3fffe04b11e4
: Memory address for initial P: 0x3fffe04b11e4
: Think of a yes/no question, then ask the oracle
: Enter a number between 1 and 8: The oracle says... Absolutely yes

**** dereferencing
#+begin_src C++ :includes '( "<iostream>" "<stdlib.h>" ) :results output replace :cmdline < in.txt

        using namespace std;

	double testScores[5], sum=0;
	double* pTestScores;
	pTestScores = testScores;
	for (int i = 0; i < 5; i++)
	{
	    cin >> *(pTestScores + i);
	    cout << "Enter the test score: " << *(pTestScores + i) << endl;
	    sum += *(pTestScores + i);
	}
	cout << "testScores: "<<testScores<<endl;
	cout << "Total for all students: " << sum << endl;
	cout << "Average score: " << sum / 5 << endl;

	

#+end_src

#+results:
: Enter the test score: 88.5
: Enter the test score: 22.1
: Enter the test score: 95.8
: Enter the test score: 100
: Enter the test score: 95.6
: testScores: 0x3fffdfc71c08
: Total for all students: 402
: Average score: 80.4
**** ptrToPtr
#+begin_src C++ :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
   using namespace std;

   int num = 10;
   int *pNum = &num;
   int **p2Num = &pNum;

   cout << "address of num   " << &num << endl;
   cout << "address in pNum  " << pNum << endl;
   cout << "address of pNum  " << &pNum << endl;
   cout << "address in p2Num " << p2Num << endl;

   int testScores[5] = { 100, 95, 99, 85,83};
   int *ptrAry[5];
   for (int i = 0; i < 5; i++ ) {
     ptrAry[i] = &( testScores[i] );
     cout << ptrAry[i] << endl;
     cout << *ptrAry[i] << endl;
     cout << *(ptrAry + i) << endl;
     cout << **(ptrAry + i) << endl;
   }


#+end_src

#+results:
#+begin_example
address of num   0x3fffdae59000
address in pNum  0x3fffdae59000
address of pNum  0x3fffdae59008
address in p2Num 0x3fffdae59008
0x3fffdae59010
100
0x3fffdae59010
100
0x3fffdae59014
95
0x3fffdae59014
95
0x3fffdae59018
99
0x3fffdae59018
99
0x3fffdae5901c
85
0x3fffdae5901c
85
0x3fffdae59020
83
0x3fffdae59020
83
#+end_example
a
**** passing pointers
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
using namespace std;

double averageCost(double* priceArray, int *count)
{
	double sum = 0;
	for(int i = 0; i < *count; i++)
	{
		sum += *(priceArray + i);
	}

	double avg = sum / *count;

	*count += 5;

	return avg;

}
int main()
{
	double prices[5]{ 5.00, 4.50, 3.75, 3.10, 6.75 };
	int num = 5;
	double average = averageCost(prices, &num);
	cout << "$" << average << endl;
	cout << "Count is now " << num << endl;
    return 0;
}

#+end_src

#+results:
: $4.62
: Count is now 10
**** passing pointers2
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
using namespace std;


void swap( int &a, int &b) {

  int tmp = a;
  a = b;
  b = tmp;

  cout << a << " " << b << endl;

}

int main()
{
  //double prices[5]{ 5.00, 4.50, 3.75, 3.10, 6.75 };
  //int num = 5;
  //double average = averageCost(prices, &num);
  //cout << "$" << average << endl;
  //cout << "Count is now " << num << endl;

  int a = 10;
  int b = 20;

  swap( a, b );
  cout << a << " " << b << endl;

  

  return 0;
}

#+end_src

#+results:
: 20 10
: 20 10

**** Overloading with struct
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
using namespace std;

struct Rectangle {
   double length;
   double width;
};

double area ( Rectangle r ) {
  return( r.length * r.width );
}

double area ( double length, double width  ) {
  return( length * width );
}

double area ( double length ) {
  return( length * length );
}

int main () {

  Rectangle R;
  R.length = 10;
  R.width = 20;
  cout << area( R ) << endl;
  cout << area( R.length, R.width ) << endl;
  cout << area( R.length ) << endl;

 return 0;
}


#+end_src

#+results:
: 200
: 200
: 100

**** Classes
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" ) :results output replace
using namespace std;

class User {
  std::string status = "gold";

 public:
     std::string first;
     std::string last;
     static int usr_count;
     std::string get_status() {
       return status;
     }
     User () {
	std::cout << "In constructor" << " Adding " << first << " " << last << "\n";
	usr_count++;
     }
     User ( std::string fName, std::string last ) {
	std::cout << "In constructor" << " Adding " << fName << " " << last << "\n";
        //cout << "Made a new user \n";
	first = fName;
	this->last = last;
	usr_count++;
     }
     ~User () {
       //usr_count--;
       //std::cout << "In destructor" << " removing " << first << " " << last << "\n";
     }

};
  
int add_user( std::vector<User> &users, User user ) {

  for( int i=0; i < users.size(); i++) {

    if ( users[i].first == user.first && users[i].last == user.last ) {
      return i;
    }

    users.push_back( user );
    return users.size() -1;
  }
}

int User::usr_count = 0;

int main () { 

    std::vector<User> users;

    //cout << "b1\n";
    User user1( "joe", "blow");
    //cout << "a1\n";
    //cout << "b2\n";
    User user2( "johny", "rotten");
    //cout << "a3\n";
    //cout << "b3\n";
    User user3( "mary", "bligh");
    //cout << "a3\n";

    //cout << "b pb 1\n";
    users.push_back( user1 );
    //cout << "b pb 2\n";
    users.push_back( user2 );
    //cout << "b pb 3\n";
    users.push_back( user3 );

    //cout << "b nu 1\n";
    User newUser( "jane", "doe");
    //cout << "a nu 1\n";

    cout << "User count = " << User::usr_count << "\n";

    cout << add_user ( users, user3 ) << std::endl;
    cout << add_user ( users, newUser ) << std::endl;


}
#+end_src

#+results:
: In constructor Adding joe blow
: In constructor Adding johny rotten
: In constructor Adding mary bligh
: In constructor Adding jane doe
: User count = 4
: 3
: 4

using namespace std;
**** Operator overloading
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" "<vector>" ) :results output replace
using namespace std;

class Position {

    public:
      int x = 10;
      int y = 20;

      //Position operator + ( Position pos) {
      //  x = x + pos.x;
      //  y = y + pos.y;
      //}
      Position operator + ( Position pos) {
        Position newPos;
	newPos.x = x + pos.x;
        newPos.y = y + pos.y;
	return newPos;
      }
      bool operator == ( Position pos) {
        if ( x == pos.x && y == pos.y ) {
	   return true;
	}
      }
      friend void print_out( Position pos);
      friend std::ostream &operator << ( std::ostream& out, Position pos );

};

void print_out( Position pos ) {
   cout << "The friend values are " << pos.x << " " << pos.y << endl;
}

std::ostream &operator << ( std::ostream& out, Position pos ) {
  out << "The values are " << pos.x << " " << pos.y;
  return out;
}


int main () {

   Position pos1, pos2;
   Position pos3 = pos1 + pos2;

   //cout << pos1.x << endl;
   //cout << pos1.y << endl;
   cout << pos3.x << endl;
   cout << pos3.y << endl;

   if ( pos1 == pos2 ) {
     cout << "the positions are the same" << endl;
   } else {
     cout << "the positions are NOT the same" << endl;
   }
   if ( pos1 == pos3 ) {
     cout << "the positions are the same" << endl;
   } else {
     cout << "the positions are NOT the same" << endl;
   }

   cout << pos3 << endl;
   print_out( pos3 );
   cout << pos3 << endl;
}


#+end_src

#+results:
: 20
: 40
: the positions are the same
: the positions are the same
: The values are 20 40
: The friend values are 20 40
: The values are 20 40

**** New/Delete
#+begin_src C++  :includes '( "<iostream>" "<stdlib.h>" ) :results output replace
using namespace std;

   int theVar = 50;
   int *ptr = new int(25);
   cout << "ptr address = " << ptr << endl;
   cout << "ptr value   = " << *ptr << endl;

   cout << "theVar address = " << &theVar << endl;
   cout << "theVar value   = " << theVar << endl;

   delete ptr;
   cout << "ptr address = " << ptr << endl;
   cout << "ptr value   = " << *ptr << endl;

   int *pary = new int[5]{ 100, 200, 300, 400, 500 };

   *(pary + 2) = 25;
   *(pary + 4) = 50;

   for ( int i = 0; i < 5; i++ ) {
     cout << "Index " << i << " value = " << *(pary + i )<< endl;
     cout << "Index " << i << " value = " << pary[i] << endl;
   }

   delete pary;

   for ( int i = 0; i < 5; i++ ) {
     cout << "d Index " << i << " value = " << *(pary + i )<< endl;
     cout << "d Index " << i << " value = " << pary[i] << endl;
   }

#+end_src

#+results:
#+begin_example
ptr address = 0x1002edc0010
ptr value   = 25
theVar address = 0x3fffe4fcabb8
theVar value   = 50
ptr address = 0x1002edc0010
ptr value   = 0
Index 0 value = 100
Index 0 value = 100
Index 1 value = 200
Index 1 value = 200
Index 2 value = 25
Index 2 value = 25
Index 3 value = 400
Index 3 value = 400
Index 4 value = 50
Index 4 value = 50
d Index 0 value = 0
d Index 0 value = 0
d Index 1 value = 0
d Index 1 value = 0
d Index 2 value = 25
d Index 2 value = 25
d Index 3 value = 400
d Index 3 value = 400
d Index 4 value = 50
d Index 4 value = 50
#+end_example

**** const
#+begin_src C++  :includes <iostream> :results output replace

class A {
    int _value = 0;
public:
    void setv ( const int a ) { 
      _value = a;
    };
    int  getv () { 
       return _value;
    };
    int  getv () const { 
       return _value;
    };
};

int main() {
    A a;
    a.setv(42);
    std::cout << "a is " << a.getv() << std::endl;

    const A b = a;
    std::cout << "b is " << b.getv() << std::endl;

    return 0;
}


#+end_src

#+results:
: a is 42
: b is 42

*** Perl test
#+begin_src perl :results output replace
my $abc = 12345;
print "Some perl code $abc\n";

my $match = "Job~~~.*(!)?ff_ext_none_0p00v_85c(!)?.*~netlist~CW_AOI21_X0P5M_A9TL.*";

my $jobName = "Job~~~ff_ext_none_0p00v_85c_child_0~netlist~CW_AOI21_X0P5M_A9TL.nominal.60kPOH_85C.spice";

if ( $jobName =~ $match ) {
   print "We have a match\n";
}

my @xyz = (1,2, 3, 5);

print @xyz;
@xyz = ();
print @xyz;

#+end_src

#+results:
: Some perl code 12345
: We have a match
: 1235

